package solution.chat.ai.innova.gptinstallerbot.handler.impl;

import org.springframework.stereotype.Component;
import org.telegram.telegrambots.meta.api.methods.PartialBotApiMethod;
import org.telegram.telegrambots.meta.api.methods.send.SendMessage;
import org.telegram.telegrambots.meta.api.objects.Update;
import org.telegram.telegrambots.meta.api.objects.replykeyboard.ReplyKeyboardMarkup;
import solution.chat.ai.innova.gptinstallerbot.handler.MenuHandler;

import static solution.chat.ai.innova.gptinstallerbot.enums.ServiceCommands.FAQ;
import static solution.chat.ai.innova.gptinstallerbot.handler.impl.StartHandler.getStartReplyKeyboardMarkup;

@Component
public class QuestionMenuHandler implements MenuHandler {

    @Override
    public SendMessage getMenu(Update update) {
        String chatId = update.getMessage().getChatId().toString();
        String text = """
                • Як я можу підключити нового бота в Telegram? – Інструкція крок за кроком, як створити та підключити нового бота в Telegram буде надана після оплати. Фактично ви надаєте список чатів (максимум 5 чатів) куди ми вручну додаємо бота і він лишається у вас.
                   • Чи є обмеження на кількість ботів, які я можу підключити? – Ми підключаємо максимум 5 ботів, тобто це максимум 5 чатів
                   • Я оплатив замовлення, коли я отримаю бота? – Як тільки ви здійснити оплату, ми перевіряємо вашу оплату і очікуємо від вас посилання на чати куди треба додати бота. Інструкцію ви отримаєте одразу після успішної оплати. Термін підключення бота - 1 робочий день. (Окрім вихідних)\s
                   • Як мені змінити налаштування вже підключеного бота? – Ніяк, це неможливо.
                   • Які функції я можу реалізувати за допомогою Telegram-ботів? – В цьому вам допоможе наша маркетингова енциклопедія https://www.notion.so/hatGPT-d4518bbc8eca47b9acd565723dcaf381?pvs=4
                   • Що робити, якщо мій бот не відповідає? – Напишіть в цей бот якщо ваш бот перестав відповідати і ми надамо вам відповідь як умова скоріше
                   • Чи можу я інтегрувати Telegram-бота з іншими сервісами або платформами? – Так, звісно - залиште свій номер телефону та ми звʼяжемось з вами.
                   • Як отримати статистику використання мого Telegram-бота? – Ми не надаємо такої статистики, це конфіденційна інформація.
                   • Як вирішити проблеми з синхронізацією або оновленнями бота? – Ваш бот автоматично оновлюється.
                   • Як мені налаштувати автоматичні відповіді в моєму Telegram-боті? - Для цього треба розробляти окремого бота, якщо вас цікавить така розробка на персональне налаштування бота під ваш запит- залиште свій номер телефону та ми звʼяжемось з вами.
                   • Чи можна інтегрувати мого бота з соціальними мережами? - Для цього треба розробляти окремого бота, якщо вас цікавить така розробка на персональне налаштування бота під ваш запит- залиште свій номер телефону та ми звʼяжемось з вами.
                   • Як додати кастомні команди до мого бота? - Для цього треба налаштовувати вашого персонального бота, якщо вас цікавить така розробка на персональне налаштування бота під ваш запит- залиште свій номер телефону та ми звʼяжемось з вами.
                   • Чи можу я використовувати бота для автоматизації маркетингових кампаній? - Для цього треба розробляти окремого бота, якщо вас цікавить така розробка на персональне налаштування бота під ваш запит- залиште свій номер телефону та ми звʼяжемось з вами.
                   • Як налаштувати бота для прийому платежів? - Для цього треба розробляти окремого бота, якщо вас цікавить така розробка на персональне налаштування бота під ваш запит- залиште свій номер телефону та ми звʼяжемось з вами.
                   • Як мені стежити за повідомленнями від користувачів через бота? - Ви можете читати запити та бачити відповіді користувачів які використовують бота у вашому чаті.
                   • Чи можна використовувати бота для проведення опитувань або голосувань? - Для цього треба розробляти окремого бота, якщо вас цікавить така розробка на персональне налаштування бота під ваш запит- залиште свій номер телефону та ми звʼяжемось з вами.
                   • Як забезпечити, щоб мій бот не порушував правила Telegram? - Інформація про політику Telegram та важливість можна почитати на офіційному сайті компанії Telegram. Наш бот жодним разом не порушує будь яку політику
                   • Як мені оновити версію мого бота? - Ваш бот автоматично оновлюється в залежності від того як швидко розвивається штучний інтелект
                   • Як використовувати бота для автоматизації адміністративних завдань у групі чи каналі?  - Для цього треба розробляти окремого бота, якщо вас цікавить така розробка на персональне налаштування бота під ваш запит- залиште свій номер телефону та ми звʼяжемось з вами.
                   • Як створити інтерактивне меню у боті? - Для цього треба розробляти окремого бота, якщо вас цікавить така розробка на персональне налаштування бота під ваш запит- залиште свій номер телефону та ми звʼяжемось з вами.
                   • Як мені видалити бота, якщо я більше не хочу його використовувати? - Просто видаліть бота з вашого чату.
                   • Чи можу я обмежити доступ до певних функцій мого бота? - Для цього треба розробляти окремого бота, якщо вас цікавить така розробка на персональне налаштування бота під ваш запит- залиште свій номер телефону та ми звʼяжемось з вами.
                   • Як бот може обробляти фотографії або відео від користувачів? - Ніяк, наразі це не можливо.
                   • Як зв'язатися з підтримкою, якщо у мене виникли проблеми з ботом? - Напишіть в цей чат свій запит і ми повернемось до нас
                   • скільки грошей і свободи може принести наш бот?
                """;

        SendMessage message = new SendMessage(chatId, text);

        ReplyKeyboardMarkup keyboardMarkup = getStartReplyKeyboardMarkup();
        message.setReplyMarkup(keyboardMarkup);
        return message;
    }

    @Override
    public boolean isApplicable(String message) {
        return FAQ.toString().equals(message);
    }

    @Override
    public PartialBotApiMethod getMessage(Update update) {
        return getMenu(update);
    }
}
